In [28]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
from sklearn.preprocessing import StandardScaler
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
import seaborn as sns

#%matplotlib inline
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

········

In [29]:
query = '''SELECT a.title, a.length, a.rating, e.name, c.rental_date
FROM film a 
JOIN film_category d
on a.film_id = d.film_id
Join category e
on d.category_id = e.category_id
JOIN inventory b 
ON a.film_id = b.film_id 
JOIN rental c 
ON b.inventory_id = c.inventory_id;'''

data = pd.read_sql_query(query, engine)
data.head()

          title  length rating    name         rental_date
0  AMADEUS HOLY     113     PG  Action 2005-08-02 01:16:59
1  AMADEUS HOLY     113     PG  Action 2005-08-18 04:26:54
2  AMADEUS HOLY     113     PG  Action 2005-06-20 20:35:28
3  AMADEUS HOLY     113     PG  Action 2005-07-09 05:01:58
4  AMADEUS HOLY     113     PG  Action 2005-07-30 08:02:39

In [30]:
data

                     title  length rating    name         rental_date
0             AMADEUS HOLY     113     PG  Action 2005-08-02 01:16:59
1             AMADEUS HOLY     113     PG  Action 2005-08-18 04:26:54
2             AMADEUS HOLY     113     PG  Action 2005-06-20 20:35:28
3             AMADEUS HOLY     113     PG  Action 2005-07-09 05:01:58
4             AMADEUS HOLY     113     PG  Action 2005-07-30 08:02:39
...                    ...     ...    ...     ...                 ...
16039  WORKING MICROCOSMOS      74      R  Travel 2005-05-30 18:45:17
16040  WORKING MICROCOSMOS      74      R  Travel 2005-06-15 09:03:52
16041  WORKING MICROCOSMOS      74      R  Travel 2005-07-07 06:38:31
16042  WORKING MICROCOSMOS      74      R  Travel 2005-07-30 00:12:41
16043  WORKING MICROCOSMOS      74      R  Travel 2005-08-23 02:06:01

[16044 rows x 5 columns]

### Data Cleaning

In [8]:
data.shape

(16044, 5)

In [9]:
data.isna().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of        title  length  rating   name  rental_date
0      False   False   False  False        False
1      False   False   False  False        False
2      False   False   False  False        False
3      False   False   False  False        False
4      False   False   False  False        False
...      ...     ...     ...    ...          ...
16039  False   False   False  False        False
16040  False   False   False  False        False
16041  False   False   False  False        False
16042  False   False   False  False        False
16043  False   False   False  False        False

[16044 rows x 5 columns]>

In [32]:
data['rental_date'] = data['rental_date'].astype(str)

In [33]:
data["rental_date"] = data["rental_date"].str[:10]
data

                     title  length rating    name rental_date
0             AMADEUS HOLY     113     PG  Action  2005-08-02
1             AMADEUS HOLY     113     PG  Action  2005-08-18
2             AMADEUS HOLY     113     PG  Action  2005-06-20
3             AMADEUS HOLY     113     PG  Action  2005-07-09
4             AMADEUS HOLY     113     PG  Action  2005-07-30
...                    ...     ...    ...     ...         ...
16039  WORKING MICROCOSMOS      74      R  Travel  2005-05-30
16040  WORKING MICROCOSMOS      74      R  Travel  2005-06-15
16041  WORKING MICROCOSMOS      74      R  Travel  2005-07-07
16042  WORKING MICROCOSMOS      74      R  Travel  2005-07-30
16043  WORKING MICROCOSMOS      74      R  Travel  2005-08-23

[16044 rows x 5 columns]

### Splitting Numerical and Categorical

In [46]:
X = data.select_dtypes(include = "number")
X_cat = data.select_dtypes(exclude = "number")

### Dummyfying

In [37]:
data.name.unique()

array(['Action', 'Animation', 'Children', 'Classics', 'Comedy',
       'Documentary', 'Drama', 'Family', 'Foreign', 'Games', 'Horror',
       'Music', 'New', 'Sci-Fi', 'Sports', 'Travel'], dtype=object)

In [43]:
dummies = pd.get_dummies(data[["name", "rating"]])
data = pd.concat([data,dummies], axis= 1)

In [48]:
transformer = StandardScaler().fit(X)
x_normalised = transformer.transform(X)
x = pd.DataFrame(x_normalised)
x.columns = X.columns

In [52]:
correlation = x.corr()
sns.heatmap(correlation)

In [51]:
sns.heatmap(x)

### X/Y Split